research-gateway/springboot-backend/src/main/resources/requests/req.xml

<soapenv:Envelope
    xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:my="http://www.example.com/my-soap"
>
    <soapenv:Header />
    <soapenv:Body>
        <my:getDataLogRequest>
            <trainId>123</trainId>
        </my:getDataLogRequest>
    </soapenv:Body>
</soapenv:Envelope>